//*******************************************************
Функция UTF8(Стр)
	Длина=СтрДлина(Стр);
	Итог="";
	Для Н=1 По Длина Цикл
		Знак=Сред(Стр,Н,1);
		Код=КодСимв(Знак);
		Если Код<128 Тогда
			Итог=Итог+Знак;
		Иначе
			Если (Код>=КодСимв("А"))И(Код<=КодСимв("п")) Тогда
				Итог=Итог+Симв(208)+Симв(144+Код-КодСимв("А"));
			ИначеЕсли (Код>=КодСимв("р"))И(Код<=КодСимв("я")) Тогда
				Итог=Итог+Симв(209)+Симв(128+Код-КодСимв("р"));
			ИначеЕсли (Знак="ё") Тогда
				Итог=Итог+Симв(209)+Симв(145);
			ИначеЕсли (Знак="Ё") Тогда
				Итог=Итог+Симв(208)+Симв(129);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;
КонецФункции
//*******************************************************
Процедура ОтправитьСМС(Телефон,ТекстСМС)
	//Телефон в формате +79ххххххххх
	// (!) Замените на свой API-ключ https://www.smspilot.ru/my-settings.php#api
	API = "XXXXXXXXXXXXYYYYYYYYYYYYZZZZZZZZXXXXXXXXXXXXYYYYYYYYYYYYZZZZZZZZ";

	Если ЗагрузитьВнешнююКомпоненту("v7plus.dll")=0 Тогда
		Сообщить("Не удалось обнаружить компоненту V7Plus.dll!");
	КонецЕсли;

	Попытка
		Соединение = СоздатьОбъект("Addin.V7HttpReader");
		Соединение.КоличествоПопытокАвторизации = 1;
	Исключение
		Сообщить("Не удалось создать объект Addin.V7HttpReader!");
	КонецПопытки;
	Адрес = "http://smspilot.ru/api.php?send=";

	стр="";

	СМС = UTF8(ТекстСМС);

	Адрес = Адрес+СокрЛП(СМС)+"&to="+Прав(СокрЛП(Телефон),11)+"&apikey="+API;
	Попытка
		Соединение.ПолучитьКакСтроку(Адрес, Стр);
		Сообщить("-+-============== Отправка СМС ================-+-");
		Успешно = "SUCCESS=SMS SENT";
		Если лев(стр,16)=Успешно Тогда
			Сообщить("Сообщение на номер: "+Телефон);
			Сообщить("С текстом: "+ТекстСМС);

			Тхт=СокрЛП(СтрЗаменить(Стр,Успешно,""));
			ЦенаСМС = Лев(Тхт,Найти(Тхт,"/")-1);
			Тхт=СтрЗаменить(Тхт,ЦенаСМС+"/","");
			ОстатокНаСчете = Лев(Тхт,Найти(Тхт,Симв(13))-1);

			Сообщить("Успешно отправлено! Цена за СМС = "+ЦенаСМС+" руб.; Остаток на счету = "+ОстатокНаСчете+" руб.");
		КонецЕсли;
	Исключение
		Сообщить("Неудачная попытка отправки СМС.");
	КонецПопытки;
КонецПроцедуры